---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayFrameText
source: html/258e8447-1a8a-0e85-0dd3-d7f20fc0cd81.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayFrameText Property

"Single day frame text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudySingledayFrameText { get; }
```